vestaCases/vestaCases/Top_Ref/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
   

    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           $internalField;
    }
    
    leftSide
    {
        type            zeroGradient;
    }
    rightSide
    {
        type            zeroGradient;
    }
    top
    { 
	type 		zeroGradient;
    }
    ground
    {
	type 		zeroGradient;
	}
    building
    {
        type            zeroGradient;
    }

    spoiler
    {
        type            zeroGradient;
    }

   
}


// ************************************************************************* //
