vestaCases/vestaCases/Top_Ref/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    faceZoneSource;
        type    faceSet;
        action  new;

        source  cylinderToFace;
        point1  (0 3.955 -21.677);
	point2	(0 3.955 -9.677);
	radius	1.5;
    }

    {
        name    turbLoc;
        type    faceZoneSet;
        action  new;

        source  setToFaceZone;
        sourceInfo
        {
            faceSet faceZoneSource;
        }
    }
);

// ************************************************************************* //